#include <stdio.h>
#include <locale.h>
#include <conio.h>
int main()
{
	setlocale(LC_ALL, "Russian");
	int A, i, j, k;
	int m1[] = {"сто ","двести ","триста ","четыреста ","пятьсот ","шестьсот ","семьсот ","восемьсот ","девятьсот "};
	int m2[] = {"двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто "};
	int m11[] = { "одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать", "девятнадцать" };
	int m3[] = {"один","два","три","четыре","пять","шесть","семь","восемь", "девять"};
	printf("Введите целое трехзначное число (100-999), программа выведет его в виде текста: ");
	scanf("%i", &A);
	i = A / 100;
	j = (A - i * 100) / 10;
	k = A - i * 100 - j * 10;
	printf(m1[i - 1]);
	if (j > 1)
	{
		printf(m2[j - 2]);
		printf(m3[k - 1]);
	}
	else if (j > 0)
		printf(m11[j - 1]);
	else
		printf(m3[k - 1]);
}