#include <stdio.h>
#include <locale.h>
#include <conio.h>
int main()
{
	setlocale(LC_ALL, "Russian");
	int A, i, j, k;
	int m1[] = {"сто ","двести ","триста ","четыреста ","пятьсот ","шестьсот ","семьсот ","восемьсот ","девятьсот "};
	int m2[] = {"десять","двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто "};
	int m11[] = { 1,2,3,4,5,6,7,8,9,10,"одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать", "девятнадцать" };
	int m3[] = {"один","два","три","четыре","пять","шесть","семь","восемь", "девять"};
	printf("Введите целое трехзначное число (100-999), программа выведет его в виде текста: ");
	scanf("%i", &A);
	i = A / 100;
	j = A % 100;
	k = j % 10;
	int s = j / 10;
	
	printf(m1[i - 1]);
	if (j > 0 && j < 10)
	{
		printf(m3[k - 1]);
	}
	else if (j > 19)
	{
		printf(m2[s - 1]);
		printf(m3[k - 1]);
	}
	else if (j > 10 && j <= 19)
		printf(m11[j - 1]);
}
